In [1]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.DataFrame()

In [3]:
df['names']=['niraj','ameen','abdul']
df['age']=[20,30,40]
df['city']=['delhi','bengaluru','hyderabad']

In [4]:
df

   names  age       city
0  niraj   20      delhi
1  ameen   30  bengaluru
2  abdul   40  hyderabad

In [6]:
df.columns
dict1={'city':'CITY'}
df.rename(dict1,axis=1)

   names  age       CITY
0  niraj   20      delhi
1  ameen   30  bengaluru
2  abdul   40  hyderabad

In [7]:
df

   names  age       city
0  niraj   20      delhi
1  ameen   30  bengaluru
2  abdul   40  hyderabad

In [10]:
l=[]
for i in df:
    df['Age']=[123,1234,345]
    
    l.append(df)
    break

In [13]:

df

   names  age       city   Age
0  niraj   20      delhi   123
1  ameen   30  bengaluru  1234
2  abdul   40  hyderabad   345